### Question 6: Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels

In [3]:
import pandas as pd

data1=pd.DataFrame({'Name':['Surya','Siva','Sekhar'],
                   'Score':[75,84,100],
                   'Location':['Hyderabad','Visakhapatnam','Delhi']})
data1

     Name  Score       Location
0   Surya     75      Hyderabad
1    Siva     84  Visakhapatnam
2  Sekhar    100          Delhi

### Question 7: Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [4]:
# Name and Score present in data1 DataFrame, taking data1 DataFrame
data1

     Name  Score       Location
0   Surya     75      Hyderabad
1    Siva     84  Visakhapatnam
2  Sekhar    100          Delhi

In [9]:
# Displaying Name and Score columns from the data1 DataFrame
data1.loc[:,["Name","Score"]]

     Name  Score
0   Surya     75
1    Siva     84
2  Sekhar    100

### Question 8: Write a Pandas program to join the two given dataframes along rows and assign all data.

In [10]:
# taking one more DataFrame(data2) to join data1 and data2 DataFrames
data2=pd.DataFrame({'Name':['Surya','Siva','Sekhar'],
                   'Occupation':['Business','Employee','Student'],
                   'Email':['surya.a@yahoo.com','siva12.k@gmail.com','sekhar343@rediff.com']})
data2

     Name Occupation                 Email
0   Surya   Business     surya.a@yahoo.com
1    Siva   Employee    siva12.k@gmail.com
2  Sekhar    Student  sekhar343@rediff.com

In [13]:
# Joining data1 and data2 DataFrames using 'Name' column which is common in both the DataFrames.
join1=data1.merge(data2,how='inner',on='Name')
print("After merging/Joining of both the DataFrames data1 and data2 is:\n")
join1

After merging/Joining of both the DataFrames data1 and data2 is:

     Name  Score       Location Occupation                 Email
0   Surya     75      Hyderabad   Business     surya.a@yahoo.com
1    Siva     84  Visakhapatnam   Employee    siva12.k@gmail.com
2  Sekhar    100          Delhi    Student  sekhar343@rediff.com

### Question 9: Write a Pandas program to detect missing values of a given DataFrame. Display True or False.

In [20]:
data2=pd.DataFrame({'Name':['Surya','Siva','Sekhar'],
                   'Occupation':['Business','Employee','Student'],
                   'Email':['surya.a@yahoo.com','siva12.k@gmail.com','sekhar343@rediff.com']})
data2

     Name Occupation                 Email
0   Surya   Business     surya.a@yahoo.com
1    Siva   Employee    siva12.k@gmail.com
2  Sekhar    Student  sekhar343@rediff.com

In [25]:
# Assigning data with Nan value
import numpy as np
data2.iloc[2,1]=np.nan
data2

     Name Occupation                 Email
0   Surya   Business     surya.a@yahoo.com
1    Siva   Employee    siva12.k@gmail.com
2  Sekhar        NaN  sekhar343@rediff.com

In [27]:
# detecting missing values in data2
data2.isna()

    Name  Occupation  Email
0  False       False  False
1  False       False  False
2  False        True  False

### Question 10: Write a Pandas program to create and display a one-dimensional array-like object containing an array of data.

In [28]:
# creating one dimensional array like object from list
list1=["Delhi","Hyderabad","Noida","Visakhapatnam"]
a1=pd.Series(list1)
a1

0            Delhi
1        Hyderabad
2            Noida
3    Visakhapatnam
dtype: object

In [29]:
# creating one dimensional array like object from tuple
tup1=("Delhi","Hyderabad","Noida","Visakhapatnam")
a2=pd.Series(tup1)
a2

0            Delhi
1        Hyderabad
2            Noida
3    Visakhapatnam
dtype: object

In [30]:
# creating one dimensional array like object from dictionary
dict1={"a":"Delhi","b":"Hyderabad","c":"Noida","d":"Visakhapatnam"}
a3=pd.Series(dict1)
a3

a            Delhi
b        Hyderabad
c            Noida
d    Visakhapatnam
dtype: object